controllers/operator/DocumentTypeController.php

SELECT * FROM `document_type` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = DocumentType::findOne($id)) !== null) return $model;