controllers/operator/DocumentController.php

    public function actionViewCertificate($id)
    {
        $document = $this->findModel($id);

        // Подготавливаем данные строго под структуру шаблона
        $data = [
            // === ОРГАНИЗАЦИЯ ===
            'org_name' => $document->organization->name ?? '',
            'org_inn' => str_pad(preg_replace('/[^0-9]/', '', $document->organization->inn ?? ''), 12, ' ', STR_PAD_RIGHT),
            'org_kpp' => str_pad(preg_replace('/[^0-9]/', '', $document->organization->kpp ?? ''), 9, ' ', STR_PAD_RIGHT),
            'org_license' => $document->organization->license_number ?? '',

            // === НАЛОГОПЛАТЕЛЬЩИК (пациент) ===
            'taxpayer_last' => $document->patient->last_name ?? '',
            'taxpayer_first' => $document->patient->first_name ?? '',
            'taxpayer_middle' => $document->patient->middle_name ?? '',
            'taxpayer_inn' => str_pad(preg_replace('/[^0-9]/', '', $document->patient->inn ?? ''), 12, ' ', STR_PAD_RIGHT),
            'taxpayer_birth' => $document->patient->birth_date ? date('d.m.Y', strtotime($document->patient->birth_date)) : '',
            'taxpayer_doc_code' => $document->patient->typePersonDocument->code ?? '',
            'taxpayer_doc_num' => $document->patient->document_series_number ?? '',
            'taxpayer_doc_date' => $document->patient->document_issue_date ? date('d.m.Y', strtotime($document->patient->document_issue_date)) : '',

            // === ДОКУМЕНТ ===
            'doc_number' => $document->document_number ?? '',
            'doc_year' => $document->document_date ? date('Y', strtotime($document->document_date)) : date('Y'),
            'doc_date' => $document->document_date ? date('d.m.Y', strtotime($document->document_date)) : '',
            'corr_number' => '0', // Номер корректировки: 0 = первичная, 1+ = исправленная (пока заглушка)
            // === СУММЫ ===
---
SELECT * FROM `type_person_document` WHERE `id`=1
SELECT * FROM `organization` WHERE `id`=1
SELECT * FROM `patient` WHERE `id`=1

            'amount_code_2' => number_format($this->sumByCode($document->id, '2'), 2, '.', ''),
            'amount_total' => number_format($document->total_amount, 2, '.', ''),

            // === ПОДПИСЬ ===
            'staff_fio' => trim("{$document->staff->last_name} {$document->staff->first_name} {$document->staff->middle_name}"),
---
SELECT * FROM `staff` WHERE `id`=1

    private function sumByCode(int $docId, string $code): float
    {
        return (new \yii\db\Query())
            ->from('document_service ds')
            ->innerJoin('service s', 'ds.service_id = s.id')
            ->where(['ds.document_id' => $docId, 's.code' => $code])
            ->sum('ds.amount') ?: 0.00;
---
SELECT SUM(ds.amount) FROM `document_service` `ds` INNER JOIN `service` `s` ON ds.service_id = s.id WHERE (`ds`.`document_id`=1) AND (`s`.`code`='1')

    protected function findModel($id)
    {
        if (($model = Document::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `document` WHERE `id`='1'