controllers/operator/IndexController.php

SELECT COUNT(*) FROM `organization`
SELECT COUNT(*) FROM `document`
SELECT COUNT(*) FROM `document` WHERE `status`='issued'
---
    public function actionIndex()
    {
        $this->layout = 'operator';
        $this->view->title = 'Кабинет оператора';

        $db = Yii::$app->db;
        $stats = [
            'patients' => (new \yii\db\Query())->from('patient')->count('*', $db),
            'organizations' => (new \yii\db\Query())->from('organization')->count('*', $db),
            'documents' => (new \yii\db\Query())->from('document')->count('*', $db),
            'documents_issued' => (new \yii\db\Query())->from('document')->where(['status' => 'issued'])->count('*', $db),