controllers/operator/StaffController.php

    protected function findModel($id)
    {
        if (($model = Staff::findOne($id)) !== null) return $model;
---
SELECT * FROM `staff` WHERE `id`='1'