models/User.php

    public static function findIdentity($id) { return static::findOne(['id' => $id]); }
---
SELECT * FROM `user` WHERE `id`=3